export default {
  days: {
    1: 'понедельник',
    2: 'вторник',
    3: 'среда',
    4: 'четверг',
    5: 'пятница',
    6: 'суббота',
    7: 'воскресенье',
  },
  groups: {
    'Компьюторные системы и комплексы': ['КС-18/1к, КС-18/2к', 'КС-19', 'КС-19к', 'КС-20/1, КС-20/1к', 'КС-20/2, КС-20/2к', 'КС-20/3к, КС-20/4к', 'КС-21/1, КС-21/1к', 'КС-21/2, КС-21/2к', 'КС-21/3к'],
    'Сетевое и системное администрирование': ['СА-18к', 'СА-19, СА-19к', 'СА-20, СА-20к', 'СА-21, СА-21к', 'СА/ТД-21к'],
    Сварщик: ['Св-19', 'Св-20', 'Св-21', 'Св-21к'],
    'Сварочное производство': ['Т-18/1, Т-18/1к', 'Т-18/2, Т-18/2к', 'Т-19/1, Т-19/1к', 'Т-19/2, Т-19/2к', 'Т-20/1, Т-20/1к', 'Т-20/2, Т-20/2к', 'Т-20к', 'Т-21/1, Т-21/1к', 'Т-21/2, Т-21/2к'],
    'Технология машиностроения': [
      'ТМ-18/1, ТМ-18/1к',
      'ТМ-18/2, ТМ-18/2к',
      'ТМ-19/1, ТМ-19/1к',
      'ТМ-19/2, ТМ-19/2к',
      'ТМ-20/1, ТМ-20/1к',
      'ТМ-20/2, ТМ-20/2к',
      'ТМ-21/1, ТМ-21/1к',
      'ТМ-21/2, ТМ-21/2к',
    ],
    'Специальные машины и устройства': ['УМ-18, УМ-18к', 'УМ-19, УМ-19к', 'УМ-20, УМ-20к', 'УМ-21, УМ-21к'],
    'Управление качеством продукции, процессов и услуг': ['УП-21, УП-21к'],
    Электромонтер: ['Эл-19', 'Эл-20, Эл-20к', 'Эл-21, Эл-21к'],
    'Техническое обслуживание и ремонт двигателей, систем и агрегатов автомобилей': ['СА/ТД-21к'],
    'Техническое обслуживание и ремонт автомобильного транспорта': ['ТО-18, ТО-18к', 'ТО-19, ТО-19к', 'ТО-20, ТО-20к', 'ТО-20/1к'],
    'Техническое регулирование и управление качеством': ['УК-18, УК-18к', 'УК-19, УК-19к', 'УК-20, УК-20к'],
  },
  groupIds: {
    'Компьюторные системы и комплексы': 'КС',
    'Сетевое и системное администрирование': 'СА',
    Сварщик: 'Св',
    'Сварочное производство': 'Т',
    'Технология машиностроения': 'ТМ',
    'Специальные машины и устройства': 'УМ',
    'Управление качеством продукции, процессов и услуг': 'УП',
    Электромонтер: 'Эл',
    'Техническое обслуживание и ремонт двигателей, систем и агрегатов автомобилей': 'ТД',
    'Техническое обслуживание и ремонт автомобильного транспорта': 'ТО',
    'Техническое регулирование и управление качеством': 'УК',
  },
  specialties: {
    'Компьюторные системы и комплексы': {
      prefix: 'КС',
      maxCourses: 4,
    },
    'Сетевое и системное администрирование': {
      prefix: 'СА',
      maxCourses: 4,
    },
    Сварщик: {
      prefix: 'Св',
      maxCourses: 3,
    },
    'Сварочное производство': {
      prefix: 'Т',
      maxCourses: 4,
    },
    'Технология машиностроения': {
      prefix: 'ТМ',
      maxCourses: 4,
    },
    'Специальные машины и устройства': {
      prefix: 'УМ',
      maxCourses: 4,
    },
    'Управление качеством продукции, процессов и услуг': {
      prefix: 'УП',
      maxCourses: 4,
    },
    Электромонтер: {
      prefix: 'Эл',
      maxCourses: 3,
    },
    'Техническое обслуживание и ремонт двигателей, систем и агрегатов автомобилей': {
      prefix: 'ТД',
      maxCourses: 4,
    },
    'Техническое обслуживание и ремонт автомобильного транспорта': {
      prefix: 'ТО',
      maxCourses: 4,
    },
    'Техническое регулирование и управление качеством': {
      prefix: 'УК',
      maxCourses: 4,
    },
  },
  bells: {
    1: { start: '8:30', end: '9:50' },
    2: { start: '10:05', end: '11:25' },
    3: { start: '11:40', end: '13:00' },
    4: { start: '13:30', end: '14:50' },
    5: { start: '15:05', end: '16:25' },
    6: { start: '16:40', end: '18:00' },
  },
  gids: [
    {
      prefix: 'ТМ',
      groups: [
        {
          id: '57',
          group: 'ТМ-18/1',
        },
        {
          id: '104',
          group: 'ТМ-18/1к',
        },
        {
          id: '58',
          group: 'ТМ-18/2',
        },
        {
          id: '105',
          group: 'ТМ-18/2к',
        },
        {
          id: '73',
          group: 'ТМ-19-1',
        },
        {
          id: '86',
          group: 'ТМ-19/1к',
        },
        {
          id: '59',
          group: 'ТМ-19/2',
        },
        {
          id: '87',
          group: 'ТМ-19/2к',
        },
        {
          id: '74',
          group: 'ТМ-20/1',
        },
        {
          id: '93',
          group: 'ТМ-20/1к',
        },
        {
          id: '75',
          group: 'ТМ-20/2',
        },
        {
          id: '94',
          group: 'ТМ-20/2к',
        },
        {
          id: '125',
          group: 'ТМ-21/1',
        },
        {
          id: '126',
          group: 'ТМ-21/1к',
        },
        {
          id: '127',
          group: 'ТМ-21/2',
        },
        {
          id: '128',
          group: 'ТМ-21/2к',
        },
      ],
    },
    {
      prefix: 'КС',
      groups: [
        {
          id: '41',
          group: 'КС-18/1к',
        },
        {
          id: '42',
          group: 'КС-18/2к',
        },
        {
          id: '43',
          group: 'КС-19',
        },
        {
          id: '44',
          group: 'КС-19к',
        },
        {
          id: '89',
          group: 'КС-20/1',
        },
        {
          id: '88',
          group: 'КС-20/1к',
        },
        {
          id: '90',
          group: 'КС-20/2',
        },
        {
          id: '138',
          group: 'КС-20/2к',
        },
        {
          id: '91',
          group: 'КС-20/3к',
        },
        {
          id: '92',
          group: 'КС-20/4к',
        },
        {
          id: '112',
          group: 'КС-21/1',
        },
        {
          id: '114',
          group: 'КС-21/1к',
        },
        {
          id: '116',
          group: 'КС-21/2',
        },
        {
          id: '115',
          group: 'КС-21/2к',
        },
        {
          id: '134',
          group: 'КС-21/3к',
        },
      ],
    },
    {
      prefix: 'Э',
      groups: [
        {
          id: '69',
          group: 'Э-18',
        },
        {
          id: '70',
          group: 'Э-18к',
        },
      ],
    },
    {
      prefix: 'T',
      groups: [
        {
          id: '21',
          group: 'T-18/1',
        },
        {
          id: '22',
          group: 'T-18/1k',
        },
        {
          id: '23',
          group: 'T-18/2',
        },
        {
          id: '24',
          group: 'T-18/2k',
        },
        {
          id: '25',
          group: 'T-19/1',
        },
        {
          id: '26',
          group: 'T-19/1k',
        },
        {
          id: '27',
          group: 'T-19/2',
        },
        {
          id: '28',
          group: 'T-19/2k',
        },
        {
          id: '77',
          group: 'Т-20/1',
        },
        {
          id: '78',
          group: 'Т-20/1к',
        },
        {
          id: '79',
          group: 'Т-20/2',
        },
        {
          id: '80',
          group: 'Т-20/2к',
        },
        {
          id: '139',
          group: 'Т-20к',
        },
        {
          id: '121',
          group: 'Т-21/1',
        },
        {
          id: '122',
          group: 'Т-21/1к',
        },
        {
          id: '123',
          group: 'Т-21/2',
        },
        {
          id: '124',
          group: 'Т-21/2к',
        },
      ],
    },
    {
      prefix: 'СВ',
      groups: [
        {
          id: '52',
          group: 'Св-19',
        },
        {
          id: '102',
          group: 'Св-20',
        },
        {
          id: '119',
          group: 'Св-21',
        },
        {
          id: '136',
          group: 'Св-21к',
        },
      ],
    },
    {
      prefix: 'СА',
      groups: [
        {
          id: '47',
          group: 'СА-18к',
        },
        {
          id: '48',
          group: 'СА-19',
        },
        {
          id: '49',
          group: 'СА-19к',
        },
        {
          id: '76',
          group: 'СА-20',
        },
        {
          id: '141',
          group: 'СА-20к',
        },
        {
          id: '117',
          group: 'СА-21',
        },
        {
          id: '118',
          group: 'СА-21к',
        },
        {
          id: '135',
          group: 'СА/ТД-21к',
        },
      ],
    },
    {
      prefix: 'УМ',
      groups: [
        {
          id: '108',
          group: 'УМ-18',
        },
        {
          id: '109',
          group: 'УМ-18к',
        },
        {
          id: '100',
          group: 'УМ-19',
        },
        {
          id: '101',
          group: 'УМ-19к',
        },
        {
          id: '98',
          group: 'УМ-20',
        },
        {
          id: '99',
          group: 'УМ-20к',
        },
        {
          id: '129',
          group: 'УМ-21',
        },
        {
          id: '130',
          group: 'УМ-21к',
        },
      ],
    },
    {
      prefix: 'ТО',
      groups: [
        {
          id: '33',
          group: 'ТО-18',
        },
        {
          id: '34',
          group: 'ТО-18к',
        },
        {
          id: '35',
          group: 'ТО-19',
        },
        {
          id: '36',
          group: 'ТО-19к',
        },
        {
          id: '82',
          group: 'ТО-20',
        },
        {
          id: '142',
          group: 'ТО-20/1к',
        },
        {
          id: '85',
          group: 'ТО-20к',
        },
      ],
    },
    {
      prefix: 'УК',
      groups: [
        {
          id: '62',
          group: 'УК-18',
        },
        {
          id: '110',
          group: 'УК-18к',
        },
        {
          id: '63',
          group: 'УК-19',
        },
        {
          id: '64',
          group: 'УК-19к',
        },
        {
          id: '96',
          group: 'УК-20',
        },
        {
          id: '97',
          group: 'УК-20к',
        },
      ],
    },
    {
      prefix: 'УП',
      groups: [
        {
          id: '133',
          group: 'УП-21',
        },
        {
          id: '131',
          group: 'УП-21к',
        },
      ],
    },
    {
      prefix: 'ЭЛ',
      groups: [
        {
          id: '72',
          group: 'Эл-19',
        },
        {
          id: '103',
          group: 'Эл-20',
        },
        {
          id: '140',
          group: 'Эл-20к',
        },
        {
          id: '113',
          group: 'Эл-21',
        },
        {
          id: '132',
          group: 'Эл-21к',
        },
        {
          id: '72',
          group: 'Эл-19',
        },
        {
          id: '103',
          group: 'Эл-20',
        },
        {
          id: '140',
          group: 'Эл-20к',
        },
        {
          id: '113',
          group: 'Эл-21',
        },
        {
          id: '132',
          group: 'Эл-21к',
        },
        {
          id: '72',
          group: 'Эл-19',
        },
        {
          id: '103',
          group: 'Эл-20',
        },
        {
          id: '140',
          group: 'Эл-20к',
        },
        {
          id: '113',
          group: 'Эл-21',
        },
        {
          id: '132',
          group: 'Эл-21к',
        },
      ],
    },
  ],
};
